In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("spam.csv",encoding='latin1')

In [5]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [6]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
5506,ham,God's love has no limit. God's grace has no me...,NaN,NaN,NaN
3260,ham,Yup i'm still having coffee wif my frens... My...,NaN,NaN,NaN
165,ham,I place all ur points on e cultures module alr...,NaN,NaN,NaN
5118,ham,Are you driving or training?,NaN,NaN,NaN
3497,ham,You said to me before i went back to bed that ...,NaN,NaN,NaN

In [7]:
df.shape

(5572, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [9]:
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [10]:
df.sample(5)

       v1                                                 v2
2358  ham  I'll talk to the others and probably just come...
4521  ham                         DO U WANT 2 MEET UP 2MORRO
2304  ham  Friendship poem: Dear O Dear U R Not Near But ...
25    ham  Just forced myself to eat a slice. I'm really ...
609   ham  It's fine, imma get a drink or somethin. Want ...

In [11]:
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(5)

     target                                               text
1545    ham  Good afternoon, my love ! Any job prospects ? ...
5451    ham  Just sing HU. I think its also important to fi...
4388    ham                          K I'm ready,  &lt;#&gt; ?
4882    ham  New Theory: Argument wins d SITUATION, but los...
3619    ham  I meant as an apology from me for texting you ...

In [12]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [13]:
df['target'] = encoder.fit_transform(df['target'])

In [14]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [15]:
df.isnull().sum()

target    0
text      0
dtype: int64

In [16]:
df.duplicated().sum()

403

In [17]:
df = df.drop_duplicates(keep ='first')

In [19]:
df.duplicated().sum()

0